Revit 2027 API
SchemaCommon.Description Property
 The property labeled "Description" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string Description { get; }
Public Shared ReadOnly Property Description As String
	Get
public:
static property String^ Description {
	String^ get ();
}
static member Description : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyString".
See Also
Reference
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace